In [92]:
#IMPORTACIONES

import pandas as pd
import numpy as np

# -----------------------------------------------------------------------
from sklearn.impute import SimpleImputer
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer
from sklearn.impute import KNNImputer

# -----------------------------------------------------------------------
import seaborn as sns
import matplotlib.pyplot as plt

# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) 
import warnings
warnings.filterwarnings("ignore")

## FASE 1: Exploración y Limpieza

### Exploración Inicial:
- Realiza una exploración inicial de los datos para identificar posibles problemas, como valores nulos, atípicos o datos faltantes en las columnas
relevantes.   
- Utiliza funciones de Pandas para obtener información sobre la estructura de los datos, la presencia de valores nulos y estadísticas básicas de
las columnas involucradas.   
- Une los dos conjuntos de datos de la forma más eficiente.

In [93]:
#Leer csv:

flight = pd.read_csv("files/Customer Flight Activity.csv")
loyalty = pd.read_csv("files/Customer Loyalty History.csv")

In [94]:
#vemos las 10 primeras filas del primer DF
flight.head(10)

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
0,100018,2017,1,3,0,3,1521,152.0,0,0
1,100102,2017,1,10,4,14,2030,203.0,0,0
2,100140,2017,1,6,0,6,1200,120.0,0,0
3,100214,2017,1,0,0,0,0,0.0,0,0
4,100272,2017,1,0,0,0,0,0.0,0,0
5,100301,2017,1,0,0,0,0,0.0,0,0
6,100364,2017,1,0,0,0,0,0.0,0,0
7,100380,2017,1,0,0,0,0,0.0,0,0
8,100428,2017,1,6,0,6,606,60.0,0,0
9,100504,2017,1,0,0,0,0,0.0,0,0

In [95]:
#vemos las 10 últimas filas del primer DF
flight.tail(10)

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
405614,999631,2018,12,11,1,12,2244,224.0,0,0
405615,999891,2018,10,0,0,0,0,0.0,0,0
405616,999758,2018,12,1,0,1,896,89.0,0,0
405617,999891,2018,11,0,0,0,0,0.0,0,0
405618,999891,2018,12,0,0,0,0,0.0,0,0
405619,999902,2018,12,0,0,0,0,0.0,0,0
405620,999911,2018,12,0,0,0,0,0.0,0,0
405621,999940,2018,12,3,0,3,1233,123.0,0,0
405622,999982,2018,12,0,0,0,0,0.0,0,0
405623,999986,2018,12,0,0,0,0,0.0,0,0

In [96]:
#vemos las 10 primeras filas del segundo DF
loyalty.head(10)

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
1,549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
2,429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
3,608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
4,530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN
5,193662,Canada,Yukon,Whitehorse,Y2K 6R0,Male,Bachelor,51124.0,Married,Star,3844.57,Standard,2012,5,NaN,NaN
6,927943,Canada,Ontario,Toronto,P5S 6R4,Female,College,NaN,Single,Star,3857.95,Standard,2014,6,NaN,NaN
7,188893,Canada,Ontario,Trenton,K8V 4B2,Male,Bachelor,100159.0,Married,Star,3861.49,Standard,2016,12,NaN,NaN
8,852392,Canada,Quebec,Montreal,H2Y 2W2,Female,Bachelor,100159.0,Married,Star,3861.49,Standard,2015,5,NaN,NaN
9,866307,Canada,Ontario,Toronto,M8Y 4K8,Male,Bachelor,100159.0,Married,Star,3861.49,Standard,2016,10,NaN,NaN

In [97]:
#vemos las 10 últimas filas del segundo DF
loyalty.tail(10)

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
16727,546773,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Married,Star,52811.49,Standard,2015,9,NaN,NaN
16728,302628,Canada,Quebec,Tremblant,H5Y 2S9,Male,Bachelor,61718.0,Single,Star,55277.45,Standard,2013,3,NaN,NaN
16729,302460,Canada,British Columbia,Whistler,V6T 1Y8,Female,Bachelor,88425.0,Married,Star,56675.94,Standard,2014,9,NaN,NaN
16730,672917,Canada,Ontario,Toronto,M1R 4K3,Female,Bachelor,76778.0,Single,Star,58166.55,Standard,2015,1,2015.0,9.0
16731,900501,Canada,Ontario,Sudbury,M5V 1G5,Male,College,NaN,Single,Star,61134.68,Standard,2012,9,NaN,NaN
16732,823768,Canada,British Columbia,Vancouver,V6E 3Z3,Female,College,NaN,Married,Star,61850.19,Standard,2012,12,NaN,NaN
16733,680886,Canada,Saskatchewan,Regina,S1J 3C5,Female,Bachelor,89210.0,Married,Star,67907.27,Standard,2014,9,NaN,NaN
16734,776187,Canada,British Columbia,Vancouver,V5R 1W3,Male,College,NaN,Single,Star,74228.52,Standard,2014,3,NaN,NaN
16735,906428,Canada,Yukon,Whitehorse,Y2K 6R0,Male,Bachelor,-57297.0,Married,Star,10018.66,2018 Promotion,2018,4,NaN,NaN
16736,652627,Canada,Manitoba,Winnipeg,R2C 0M5,Female,Bachelor,75049.0,Married,Star,83325.38,Standard,2015,12,2016.0,8.0

In [98]:
#vemos los duplicados en los dos DF:

print(f"En el primer DataFrame hay {flight.duplicated().sum()} duplicados")
print(f"En el segundo DataFrame hay {loyalty.duplicated().sum()} duplicados")

En el primer DataFrame hay 1864 duplicados
En el segundo DataFrame hay 0 duplicados

In [99]:
#Vamos a comprobar cómo son los suplicados que hay en el DF.

duplicates_df = flight[flight.duplicated(keep=False)] #hay que poner keep=False para que todos los valores duplicados se muestren. En este caso los necesitamos para comprobarlo
duplicates_df.head(6)

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
41,101902,2017,1,0,0,0,0,0.0,0,0
42,101902,2017,1,0,0,0,0,0.0,0,0
226,112142,2017,1,0,0,0,0,0.0,0,0
227,112142,2017,1,0,0,0,0,0.0,0,0
477,126100,2017,1,0,0,0,0,0.0,0,0
478,126100,2017,1,0,0,0,0,0.0,0,0

In [100]:
#Lo primero que vamos a hacer antes de unir ambas tablas es gestionar los duplicados:

flight.drop_duplicates(inplace=True)
flight.reset_index(drop=True)

print(f"Hay {flight.duplicated().sum()} duplicados en el DF después de realizar el .drop_duplicates")
flight.head()

Hay 0 duplicados en el DF después de realizar el .drop_duplicates

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
0,100018,2017,1,3,0,3,1521,152.0,0,0
1,100102,2017,1,10,4,14,2030,203.0,0,0
2,100140,2017,1,6,0,6,1200,120.0,0,0
3,100214,2017,1,0,0,0,0,0.0,0,0
4,100272,2017,1,0,0,0,0,0.0,0,0

In [101]:
#Unimos las columnas para poder realizar los cambios:
df_union = loyalty.merge(flight, on =["Loyalty Number"], how = "left")
df_union.sample(5)

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
9015,696577,Canada,Alberta,Edmonton,T3G 6Y6,Female,Bachelor,58713.0,Single,Nova,3757.80,2018 Promotion,2018,4,NaN,NaN,2018,5,1,0,1,687,68.0,0,0
93617,496329,Canada,Ontario,Ottawa,K1F 2R2,Male,Bachelor,77546.0,Married,Aurora,21710.28,Standard,2017,3,NaN,NaN,2017,11,9,1,10,1270,127.0,0,0
111164,682709,Canada,Ontario,Toronto,M1R 4K3,Male,Bachelor,103965.0,Married,Nova,2929.92,Standard,2014,1,NaN,NaN,2017,11,8,0,8,3392,339.0,0,0
287251,399670,Canada,Ontario,Toronto,M2Z 4K1,Male,Bachelor,51510.0,Married,Star,2810.46,Standard,2013,8,NaN,NaN,2017,11,6,0,6,1938,193.0,0,0
236839,295355,Canada,Ontario,Thunder Bay,K8T 5M5,Female,Bachelor,79424.0,Single,Nova,42937.35,Standard,2013,5,NaN,NaN,2017,1,8,1,9,963,96.0,0,0

In [102]:
print(f"En el DataFrame final tenemos un total de {df_union.shape[0]} filas y {df_union.shape[1]} columnas.")
print(f"Finalmente el total de duplicados en el DataFrame es de {flight.duplicated().sum()}")

En el DataFrame final tenemos un total de 403760 filas y 25 columnas.
Finalmente el total de duplicados en el DataFrame es de 0

In [103]:
#Nos muestra la cantidad de nulos en el total del DataFrame
print(f"Tenemos {df_union.isnull().sum()} nulos en el conjunto de datos.")

Tenemos Loyalty Number                      0
Country                             0
Province                            0
City                                0
Postal Code                         0
Gender                              0
Education                           0
Salary                         102260
Marital Status                      0
Loyalty Card                        0
CLV                                 0
Enrollment Type                     0
Enrollment Year                     0
Enrollment Month                    0
Cancellation Year              354110
Cancellation Month             354110
Year                                0
Month                               0
Flights Booked                      0
Flights with Companions             0
Total Flights                       0
Distance                            0
Points Accumulated                  0
Points Redeemed                     0
Dollar Cost Points Redeemed         0
dtype: int64 nulos en el conjunto de datos.

In [104]:
#Nos muestra los tipos de columnas
print(f"Los tipos de las columnas son:")
display(pd.DataFrame(df_union.dtypes, columns = ["type"]))

Los tipos de las columnas son:

                                type
Loyalty Number                 int64
Country                       object
Province                      object
City                          object
Postal Code                   object
Gender                        object
Education                     object
Salary                       float64
Marital Status                object
Loyalty Card                  object
CLV                          float64
Enrollment Type               object
Enrollment Year                int64
Enrollment Month               int64
Cancellation Year            float64
Cancellation Month           float64
Year                           int64
Month                          int64
Flights Booked                 int64
Flights with Companions        int64
Total Flights                  int64
Distance                       int64
Points Accumulated           float64
Points Redeemed                int64
Dollar Cost Points Redeemed    int64

### Limpieza:

In [105]:
#poner en minúsculas las columnas:
print(f"Las columnas antes de ser cambiadas son: {list(df_union.columns)}")
df_union.columns = df_union.columns.str.lower()
print("---")
print(f"Las columnas después de ser cambiadas son: {list(df_union.columns)}")

Las columnas antes de ser cambiadas son: ['Loyalty Number', 'Country', 'Province', 'City', 'Postal Code', 'Gender', 'Education', 'Salary', 'Marital Status', 'Loyalty Card', 'CLV', 'Enrollment Type', 'Enrollment Year', 'Enrollment Month', 'Cancellation Year', 'Cancellation Month', 'Year', 'Month', 'Flights Booked', 'Flights with Companions', 'Total Flights', 'Distance', 'Points Accumulated', 'Points Redeemed', 'Dollar Cost Points Redeemed']
---
Las columnas después de ser cambiadas son: ['loyalty number', 'country', 'province', 'city', 'postal code', 'gender', 'education', 'salary', 'marital status', 'loyalty card', 'clv', 'enrollment type', 'enrollment year', 'enrollment month', 'cancellation year', 'cancellation month', 'year', 'month', 'flights booked', 'flights with companions', 'total flights', 'distance', 'points accumulated', 'points redeemed', 'dollar cost points redeemed']

In [106]:
#Cambiar los nombres de las columnas para que no existan espacios y sean reemplazados por '_'
print(f"Las columnas antes de ser cambiadas son: {list(df_union.columns)}")
df_union.rename(columns=lambda x: x.replace(' ', '_'), inplace=True)
print("---")
print(f"Las columnas después de ser cambiadas son: {list(df_union.columns)}")

Las columnas antes de ser cambiadas son: ['loyalty number', 'country', 'province', 'city', 'postal code', 'gender', 'education', 'salary', 'marital status', 'loyalty card', 'clv', 'enrollment type', 'enrollment year', 'enrollment month', 'cancellation year', 'cancellation month', 'year', 'month', 'flights booked', 'flights with companions', 'total flights', 'distance', 'points accumulated', 'points redeemed', 'dollar cost points redeemed']
---
Las columnas después de ser cambiadas son: ['loyalty_number', 'country', 'province', 'city', 'postal_code', 'gender', 'education', 'salary', 'marital_status', 'loyalty_card', 'clv', 'enrollment_type', 'enrollment_year', 'enrollment_month', 'cancellation_year', 'cancellation_month', 'year', 'month', 'flights_booked', 'flights_with_companions', 'total_flights', 'distance', 'points_accumulated', 'points_redeemed', 'dollar_cost_points_redeemed']

In [107]:
#poner en minúsculas los valores del DF:

for col in df_union.columns:
        # Verificar si la columna contiene strings y convertirlos a minúsculas
        if df_union[col].dtype == 'object':
            df_union[col] = df_union[col].str.lower()

df_union.head(2)

,loyalty_number,country,province,city,postal_code,gender,education,salary,marital_status,loyalty_card,clv,enrollment_type,enrollment_year,enrollment_month,cancellation_year,cancellation_month,year,month,flights_booked,flights_with_companions,total_flights,distance,points_accumulated,points_redeemed,dollar_cost_points_redeemed
0,480934,canada,ontario,toronto,m2z 4k1,female,bachelor,83236.0,married,star,3839.14,standard,2016,2,NaN,NaN,2017,1,0,0,0,0,0.0,0,0
1,480934,canada,ontario,toronto,m2z 4k1,female,bachelor,83236.0,married,star,3839.14,standard,2016,2,NaN,NaN,2017,2,3,0,3,2823,282.0,0,0

In [111]:
#Cambiar a tipo de dato de las columnas que deberían ser INT:

lista_int = ["cancellation_year", "cancellation_month", "points_accumulated"]

#Manejamos los valores no numéricos:
#Reemplazamos los valores no numéricos con cero:
df_union[lista_int] = df_union[lista_int].apply(pd.to_numeric, errors='coerce').fillna(0)


print(f"Antes del cambio de tipo:")
display(pd.DataFrame(df_union[["cancellation_year", "cancellation_month", "points_accumulated"]].dtypes, columns = ["type"]))
print("----")

for col in lista_int: 
    df_union[col] = df_union[col].astype(int)

print(f"Después del cambio de tipo, las columnas quedan:")
display(pd.DataFrame(df_union[["cancellation_year", "cancellation_month", "points_accumulated"]].dtypes, columns = ["type"]))

Antes del cambio de tipo:

                       type
cancellation_year   float64
cancellation_month  float64
points_accumulated  float64

----
Después del cambio de tipo, las columnas quedan:

                     type
cancellation_year   int64
cancellation_month  int64
points_accumulated  int64

In [112]:
df_union.head()

,loyalty_number,country,province,city,postal_code,gender,education,salary,marital_status,loyalty_card,clv,enrollment_type,enrollment_year,enrollment_month,cancellation_year,cancellation_month,year,month,flights_booked,flights_with_companions,total_flights,distance,points_accumulated,points_redeemed,dollar_cost_points_redeemed
0,480934,canada,ontario,toronto,m2z 4k1,female,bachelor,83236.0,married,star,3839.14,standard,2016,2,0,0,2017,1,0,0,0,0,0,0,0
1,480934,canada,ontario,toronto,m2z 4k1,female,bachelor,83236.0,married,star,3839.14,standard,2016,2,0,0,2017,2,3,0,3,2823,282,0,0
2,480934,canada,ontario,toronto,m2z 4k1,female,bachelor,83236.0,married,star,3839.14,standard,2016,2,0,0,2017,3,0,0,0,0,0,0,0
3,480934,canada,ontario,toronto,m2z 4k1,female,bachelor,83236.0,married,star,3839.14,standard,2016,2,0,0,2017,4,0,0,0,0,0,0,0
4,480934,canada,ontario,toronto,m2z 4k1,female,bachelor,83236.0,married,star,3839.14,standard,2016,2,0,0,2018,10,6,2,8,3352,335,465,38